Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetDocument
Gets a reference to the current document.
Returns:
Returns a reference to the current document.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHookOrientationAngle(System.Int32)
Get the hook orientation angle at end that is currently in the rebar.
end:
The end of bar. Should be 0 for start or 1 for end.
Returns:
The hook orientation angle at end that is currently in the rebar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetHookOrientationAngle(System.Int32,System.Double)
Set the hook orientation angle at end. This information is set to the rebar after the API execution is finished successfully.
end:
The end of bar. Should be 0 for start or 1 for end.
angle:
The hook orientation angle at end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHookPlaneNormalForBarIdx(System.Int32,System.Int32)
Returns the normal of plane in which the hook at end of bar with index barPositionIndex that is currently in Rebar.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (GetNumberOfBars()-1).
Returns:
The normal of plane in which the hook at end of bar with index barPositionIndex that is currently in Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, GetNumberOfBars()-1 ].
-or-
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done.
We consider a hook plane normal valid if it isn't parallel with the bar direction at end.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
Index of the bar for which it will set hook plane normal.
hookNormal:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
hookNormal has zero length.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHostId
Gets the id of the host structural for this rebar.
Returns:
Returns the id of the host structural for this rebar.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarsNumber
Gets the number of bars specified in the layout options.
This is used to calculate the sets driven by bar number.
Returns:
Returns the number of bars specified in the layout options.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetLayoutRule
Gets the layout rule for this bar.
Returns:
Returns the layout rule for this bar.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBendingRadius
Gets the current bending radius of the rebar.
Returns:
Returns the current bending radius of the rebar.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetAttachmentType
Returns attachment type for stirrups to be used in cover calculation.
Returns:
InteriorFace : rebar to attach to interior face of cover reference.
ExteriorFace : rebar to attach to exterior face of cover reference.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarStyle
Gets the style of the rebar.
Returns:
Gets the style of the rebar (Standard or StirrupTie).
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarDiameter
Gets the diameter of the Rebar.
Returns:
Returns the diameter of the Rebar.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetEndConstraint
Gets the current constraint for the end handle of the Rebar.
Returns:
Returns the current constraint for the end handle of the Rebar. Return value is null is no constraint is present.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetStartConstraint
Gets the current constraint for the start handle of the Rebar.
Returns:
Returns the current constraint for the start handle of the Rebar. Return value is null if no constraint is present.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetCustomConstraints
Gets all rebar constraints that are attached to custom handles for this rebar.
Returns:
Returns all rebar constraints that are attached to custom handles for this rebar. This array does not contains the start and end constraints.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetChangedCustomHandles
Returns an array containing custom handles that were changed since the last regeneration.
Array is empty if no handles were changed since the last regeneration.
Returns:
Returns an array containing the tags of custom handles that were changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarGeometry(System.Int32)
Returns the geometry for a bar at the specified index currently in the Rebar.
barIndex:
The index of the bar. Should be a number between 0 and GetNumberOfBars() - 1.
Returns:
Returns an array of curves that defines the bar at the specified index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, GetNumberOfBars()-1 ].
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetNumberOfBars
Returns the number of bars currently in the rebar.
Returns:
Returns the number of bars currently in the rebar.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.ErrorMessage
The reason for calculation failure. If the calculation fails, this message will be shown in an error, or warning if we are editing the constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: errorMessage is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsReversed
Used to store the state of the bar refering to the direction of the bars.
This is useful when using face intersection to calculate bars.
After mirroring, curves created from intersecting faces may be reversed,
so we use this to store the state and keep the rebar pointing in the correct direction.
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.HostMirrored
If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration.
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.Spacing
The spacing between the bars, according to the LayoutRule.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBendingRadiusChanged
Indicates if the style has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsStyleChanged
Indicates if the style has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsAttachmentTypeChanged
Indicates if the attachment type has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsEndConstraintChanged
Indicates if the end handle constraint has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsStartConstraintChanged
Indicates if the start handle constraint has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsBarsNumberChanged
Indicates if the bar number has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsSpacingChanged
Indicates if the spacing has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.IsLayoutChanged
Indicates if the layout has changed since the last regeneration.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.WorkshopInstructions
Identifies the workshop instructions of this rebar.
Since:
2019

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreWorkshopInstructionsChanged
Indicates if the workshop instructions have changed since the last regeneration.
Since:
2019

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData
Class holding the information needed to calculate the rebar curves.
Since:
2018